VMs/Results/Baseline/Fio/results_1.txt
hostname=server, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.28, flags=1
<server> write.test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<server> ...
<server> Starting 4 processes
<server> 
write.test: (groupid=0, jobs=1): err= 0: pid=43779: Tue Dec 10 17:21:50 2024
  read: IOPS=1528, BW=6114KiB/s (6261kB/s)(1791MiB/300002msec)
    slat (usec): min=10, max=13652, avg=225.24, stdev=511.68
    clat (usec): min=3, max=18526, avg=349.74, stdev=500.33
     lat (usec): min=15, max=18654, avg=613.65, stdev=737.10
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    7], 20.00th=[   10],
     | 30.00th=[   53], 40.00th=[  262], 50.00th=[  293], 60.00th=[  322],
     | 70.00th=[  363], 80.00th=[  449], 90.00th=[  660], 95.00th=[  971],
     | 99.00th=[ 2573], 99.50th=[ 3458], 99.90th=[ 5473], 99.95th=[ 6390],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 2419, max= 9536, per=24.84%, avg=6121.76, stdev=1319.92, samples=598
   iops        : min=  604, max= 2384, avg=1530.21, stdev=329.98, samples=598
  lat (usec)   : 4=0.18%, 10=20.10%, 20=8.33%, 50=1.31%, 100=0.71%
  lat (usec)   : 250=5.46%, 500=47.11%, 750=9.11%, 1000=2.90%
  lat (msec)   : 2=3.17%, 4=1.28%, 10=0.33%, 20=0.01%
  cpu          : usr=5.24%, sys=33.64%, ctx=545784, majf=0, minf=14
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=458542,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43780: Tue Dec 10 17:21:50 2024
  read: IOPS=1533, BW=6133KiB/s (6281kB/s)(1797MiB/300001msec)
    slat (usec): min=10, max=15578, avg=223.86, stdev=514.33
    clat (usec): min=3, max=13609, avg=349.61, stdev=497.00
     lat (usec): min=15, max=18959, avg=611.87, stdev=734.59
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    7], 20.00th=[   10],
     | 30.00th=[   52], 40.00th=[  262], 50.00th=[  293], 60.00th=[  322],
     | 70.00th=[  367], 80.00th=[  449], 90.00th=[  660], 95.00th=[  979],
     | 99.00th=[ 2540], 99.50th=[ 3425], 99.90th=[ 5407], 99.95th=[ 6390],
     | 99.99th=[ 8225]
   bw (  KiB/s): min= 1580, max= 9564, per=24.91%, avg=6140.72, stdev=1351.52, samples=598
   iops        : min=  395, max= 2391, avg=1534.96, stdev=337.89, samples=598
  lat (usec)   : 4=0.22%, 10=20.23%, 20=8.13%, 50=1.36%, 100=0.69%
  lat (usec)   : 250=5.69%, 500=47.03%, 750=8.88%, 1000=2.90%
  lat (msec)   : 2=3.24%, 4=1.31%, 10=0.31%, 20=0.01%
  cpu          : usr=5.07%, sys=33.85%, ctx=545758, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=460007,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43781: Tue Dec 10 17:21:50 2024
  read: IOPS=1535, BW=6141KiB/s (6288kB/s)(1799MiB/300001msec)
    slat (usec): min=10, max=18741, avg=221.62, stdev=505.96
    clat (usec): min=3, max=13239, avg=348.88, stdev=492.30
     lat (usec): min=15, max=21650, avg=610.19, stdev=732.47
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   76], 40.00th=[  262], 50.00th=[  293], 60.00th=[  322],
     | 70.00th=[  363], 80.00th=[  449], 90.00th=[  652], 95.00th=[  963],
     | 99.00th=[ 2540], 99.50th=[ 3392], 99.90th=[ 5473], 99.95th=[ 6325],
     | 99.99th=[ 8225]
   bw (  KiB/s): min= 1876, max= 9768, per=24.93%, avg=6143.66, stdev=1294.43, samples=598
   iops        : min=  469, max= 2442, avg=1535.69, stdev=323.63, samples=598
  lat (usec)   : 4=0.13%, 10=19.92%, 20=8.25%, 50=1.34%, 100=0.71%
  lat (usec)   : 250=5.71%, 500=47.28%, 750=9.08%, 1000=2.82%
  lat (msec)   : 2=3.17%, 4=1.28%, 10=0.31%, 20=0.01%
  cpu          : usr=5.29%, sys=33.70%, ctx=544269, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=460567,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43782: Tue Dec 10 17:21:50 2024
  read: IOPS=1563, BW=6256KiB/s (6406kB/s)(1833MiB/300001msec)
    slat (usec): min=10, max=16618, avg=213.95, stdev=488.54
    clat (usec): min=3, max=21037, avg=346.87, stdev=485.15
     lat (usec): min=15, max=24326, avg=600.34, stdev=714.86
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    7], 20.00th=[   10],
     | 30.00th=[  110], 40.00th=[  262], 50.00th=[  293], 60.00th=[  322],
     | 70.00th=[  363], 80.00th=[  445], 90.00th=[  644], 95.00th=[  947],
     | 99.00th=[ 2442], 99.50th=[ 3326], 99.90th=[ 5342], 99.95th=[ 6259],
     | 99.99th=[ 8455]
   bw (  KiB/s): min= 2027, max= 9928, per=25.41%, avg=6263.11, stdev=1431.85, samples=598
   iops        : min=  506, max= 2482, avg=1565.55, stdev=357.98, samples=598
  lat (usec)   : 4=0.22%, 10=20.01%, 20=7.82%, 50=1.22%, 100=0.67%
  lat (usec)   : 250=5.68%, 500=47.95%, 750=9.01%, 1000=2.80%
  lat (msec)   : 2=3.11%, 4=1.22%, 10=0.29%, 20=0.01%, 50=0.01%
  cpu          : usr=5.38%, sys=33.63%, ctx=545872, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=469200,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=24.1MiB/s (25.2MB/s), 6114KiB/s-6256KiB/s (6261kB/s-6406kB/s), io=7220MiB (7571MB), run=300001-300002msec

Disk stats (read/write):
  dm-0: ios=1532171/96, merge=0/0, ticks=349036/64, in_queue=349100, util=100.00%

Disk stats (read/write):
  sda: ios=1533264/78, merge=0/18, ticks=348443/48, in_queue=348508, util=100.00%
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 17:21:50 2024
  read: IOPS=6161, BW=24.1Mi (25.2M)(7220MiB/300002msec)
    slat (usec): min=10, max=18741, avg=220.79, stdev=436.15
    clat (usec): min=3, max=21037, avg=348.73, stdev=426.17
     lat (usec): min=15, max=24326, avg=608.52, stdev=630.66
   bw (  KiB/s): min= 5483, max=29260, per=18.81%, avg=18547.49, stdev=1359.68, samples=1794
   iops        : min= 1370, max= 7315, avg=4636.20, stdev=339.94, samples=1794
  lat (usec)   : 4=0.19%, 10=20.07%, 20=8.13%, 50=1.31%, 100=0.69%
  lat (usec)   : 250=5.63%, 500=47.35%, 750=9.02%, 1000=2.86%
  lat (msec)   : 2=3.17%, 4=1.27%, 10=0.31%, 20=0.01%, 50=0.01%
  cpu          : usr=5.24%, sys=33.71%, ctx=2181683, majf=0, minf=60
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1848316,0,0,0 short=0,0,0,0 dropped=0,0,0,0