VMs/Results/Baseline/Fio/results_2.txt
hostname=server, be=0, 64-bit, os=Linux, arch=x86-64, fio=fio-3.28, flags=1
<server> write.test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
<server> ...
<server> Starting 4 processes
<server> 
write.test: (groupid=0, jobs=1): err= 0: pid=43791: Tue Dec 10 17:32:51 2024
  read: IOPS=1366, BW=5464KiB/s (5595kB/s)(1601MiB/300001msec)
    slat (usec): min=11, max=46851, avg=241.78, stdev=560.71
    clat (usec): min=3, max=23740, avg=390.90, stdev=585.89
     lat (usec): min=16, max=46954, avg=690.29, stdev=865.95
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   10],
     | 30.00th=[   22], 40.00th=[  277], 50.00th=[  318], 60.00th=[  355],
     | 70.00th=[  408], 80.00th=[  519], 90.00th=[  766], 95.00th=[ 1172],
     | 99.00th=[ 2900], 99.50th=[ 3818], 99.90th=[ 6325], 99.95th=[ 7504],
     | 99.99th=[10945]
   bw (  KiB/s): min= 1161, max= 8486, per=25.20%, avg=5468.35, stdev=1414.49, samples=598
   iops        : min=  290, max= 2121, avg=1366.92, stdev=353.63, samples=598
  lat (usec)   : 4=0.04%, 10=20.26%, 20=8.85%, 50=2.69%, 100=0.95%
  lat (usec)   : 250=1.25%, 500=45.06%, 750=10.53%, 1000=4.11%
  lat (msec)   : 2=4.12%, 4=1.69%, 10=0.43%, 20=0.01%, 50=0.01%
  cpu          : usr=5.08%, sys=34.12%, ctx=459664, majf=0, minf=13
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=409827,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43792: Tue Dec 10 17:32:51 2024
  read: IOPS=1347, BW=5391KiB/s (5521kB/s)(1579MiB/300001msec)
    slat (usec): min=11, max=30218, avg=239.24, stdev=559.19
    clat (usec): min=3, max=25694, avg=400.97, stdev=602.59
     lat (usec): min=16, max=33819, avg=698.29, stdev=875.81
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    8], 10.00th=[    8], 20.00th=[   12],
     | 30.00th=[   29], 40.00th=[  281], 50.00th=[  322], 60.00th=[  359],
     | 70.00th=[  412], 80.00th=[  529], 90.00th=[  783], 95.00th=[ 1221],
     | 99.00th=[ 2999], 99.50th=[ 3982], 99.90th=[ 6456], 99.95th=[ 7701],
     | 99.99th=[10814]
   bw (  KiB/s): min= 1029, max= 8960, per=24.85%, avg=5392.36, stdev=1458.22, samples=598
   iops        : min=  257, max= 2240, avg=1347.91, stdev=364.57, samples=598
  lat (usec)   : 4=0.02%, 10=18.33%, 20=9.86%, 50=2.79%, 100=1.03%
  lat (usec)   : 250=1.17%, 500=45.40%, 750=10.68%, 1000=4.21%
  lat (msec)   : 2=4.25%, 4=1.77%, 10=0.48%, 20=0.01%, 50=0.01%
  cpu          : usr=4.96%, sys=34.01%, ctx=456810, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=404350,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43793: Tue Dec 10 17:32:51 2024
  read: IOPS=1364, BW=5457KiB/s (5588kB/s)(1599MiB/300002msec)
    slat (usec): min=10, max=29771, avg=241.20, stdev=556.10
    clat (usec): min=3, max=26771, avg=393.97, stdev=587.74
     lat (usec): min=16, max=38269, avg=690.50, stdev=857.16
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    8], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   24], 40.00th=[  281], 50.00th=[  318], 60.00th=[  355],
     | 70.00th=[  408], 80.00th=[  519], 90.00th=[  766], 95.00th=[ 1188],
     | 99.00th=[ 2933], 99.50th=[ 3851], 99.90th=[ 6325], 99.95th=[ 7570],
     | 99.99th=[10814]
   bw (  KiB/s): min= 1283, max= 9109, per=25.17%, avg=5461.68, stdev=1444.08, samples=598
   iops        : min=  320, max= 2277, avg=1365.23, stdev=361.05, samples=598
  lat (usec)   : 4=0.01%, 10=18.82%, 20=9.89%, 50=2.74%, 100=1.01%
  lat (usec)   : 250=1.24%, 500=45.30%, 750=10.52%, 1000=4.11%
  lat (msec)   : 2=4.18%, 4=1.72%, 10=0.44%, 20=0.01%, 50=0.01%
  cpu          : usr=5.11%, sys=34.16%, ctx=459021, majf=0, minf=15
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=409288,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
write.test: (groupid=0, jobs=1): err= 0: pid=43794: Tue Dec 10 17:32:51 2024
  read: IOPS=1345, BW=5384KiB/s (5513kB/s)(1577MiB/300001msec)
    slat (usec): min=11, max=30249, avg=247.68, stdev=565.58
    clat (usec): min=3, max=28032, avg=394.80, stdev=593.92
     lat (usec): min=16, max=34257, avg=700.14, stdev=872.89
    clat percentiles (usec):
     |  1.00th=[    5],  5.00th=[    7], 10.00th=[    8], 20.00th=[   11],
     | 30.00th=[   22], 40.00th=[  281], 50.00th=[  318], 60.00th=[  355],
     | 70.00th=[  408], 80.00th=[  523], 90.00th=[  775], 95.00th=[ 1188],
     | 99.00th=[ 2933], 99.50th=[ 3916], 99.90th=[ 6521], 99.95th=[ 7767],
     | 99.99th=[10552]
   bw (  KiB/s): min= 1136, max= 8976, per=24.83%, avg=5387.59, stdev=1383.23, samples=598
   iops        : min=  284, max= 2244, avg=1346.71, stdev=345.83, samples=598
  lat (usec)   : 4=0.04%, 10=19.26%, 20=9.97%, 50=2.54%, 100=0.95%
  lat (usec)   : 250=1.13%, 500=44.77%, 750=10.76%, 1000=4.25%
  lat (msec)   : 2=4.17%, 4=1.69%, 10=0.45%, 20=0.01%, 50=0.01%
  cpu          : usr=5.13%, sys=33.94%, ctx=456025, majf=0, minf=16
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=403788,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=21.2MiB/s (22.2MB/s), 5384KiB/s-5464KiB/s (5513kB/s-5595kB/s), io=6356MiB (6665MB), run=300001-300002msec

Disk stats (read/write):
  dm-0: ios=1349135/40, merge=0/0, ticks=345644/8, in_queue=345652, util=100.00%

Disk stats (read/write):
  sda: ios=1350041/15, merge=1/25, ticks=341823/13, in_queue=341844, util=100.00%
All clients: (groupid=0, jobs=4): err= 0: pid=0: Tue Dec 10 17:32:51 2024
  read: IOPS=5424, BW=21.2Mi (22.2M)(6356MiB/300002msec)
    slat (usec): min=10, max=46851, avg=241.83, stdev=484.63
    clat (usec): min=3, max=28032, avg=397.68, stdev=514.45
     lat (usec): min=16, max=46954, avg=696.79, stdev=751.32
   bw (  KiB/s): min= 3448, max=27045, per=18.71%, avg=16241.62, stdev=1428.08, samples=1794
   iops        : min=  861, max= 6761, avg=4059.85, stdev=357.04, samples=1794
  lat (usec)   : 4=0.03%, 10=19.17%, 20=9.64%, 50=2.69%, 100=0.98%
  lat (usec)   : 250=1.20%, 500=45.14%, 750=10.62%, 1000=4.17%
  lat (msec)   : 2=4.18%, 4=1.72%, 10=0.45%, 20=0.01%, 50=0.01%
  cpu          : usr=5.07%, sys=34.06%, ctx=1831520, majf=0, minf=59
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=1627253,0,0,0 short=0,0,0,0 dropped=0,0,0,0